# Задача 14: Требуется вывести все целые степени двойки 
# (т.е. числа вида 2k), не превосходящие числа N.

num = int(input('Введите число'))
derdreeof2 = 1
while derdreeof2 <=num:
    print(derdreeof2)
    derdreeof2 *=2
    

